KC5-BP/C8051F020-WS2812B/refFiles/mx_manip/ws2812_mx_manip.c
/*..-----------------------------------------------------------------------------------.
../ .---------------------------------------------------------------------------------. \
./´/
|x| __--""'\
|x|  ,__  -'""`;
|x| /   \  /"'  \
|x|   __// \-"-_/
|x| ´"   \  |           > Title : ws2812_mx_manip
|x| \     |  \  _.-"',
|x| "^,-´\/\  '" ,--. \         > Src : ws2812_matrix.c
|x|  \|\| | | , /    | |            >   (first version of the actual header)
|x|     '`'\|._ |   / /
|x|         '\),/  / |          > Creation : 2019.11.21 (Initial creation date)
|x|           |/.-"_/           > By :  KC5-BP
|x| .__---+-_/'|--"
|x|         _| |_--,            > Description :
|x|        ',/ |   /                Declarations of RGB's ws2812b LEDs usage funct. .
|x|        /|| |  /                 as a matrix purpose.
|x|     |\| |/ |- |
|x| .-,-/ | /  '/-"
|x| -\|/-/\/ ^,'|
|x| _-     |  |/
|x|  .  --"  /
|x| /--__,.-/
.\`\__________________________________________________________________________________/´/
..`____________________________________________________________________________________´
========================================================================================>
=======================================================================================*/
// Linker to : ..
// .. definition folder SFR (Like Port Definition "P5", "P6", "TR0", etc...)
#include <c8051f020.h> // <= Would delete it ...
// .. created header for ws2812b led usage.
#include "../led_manip/ws2812_led_manip.h"  // For the << pixel >> struct.
// .. created header for ws2812b matrix usage.
#include "ws2812_mx_manip.h"
// .. character's definitions.
//#include "characters/kc5_bp_matrix_alphanum.h"
// .. character's BIG definitions (Letter's height : X14).
//#include "characters/kc5_bp_matrix_alpha_big.h"

//-- GLOBAL VARIABLES INIT : ----------------------------->
xdata offsetText Offset = {0, 0};
xdata matrixFormat formatDisplay = {0, CLASSIC};

//===================================================
//===============================\FUNCTIONS'_Prototypes/================================>
#ifdef __KC5_BP_MATRIX_ALPHANUM__
//======================================================================================>
/* Description  :   Retrieve Width and Height of a character.						   */
void retrieveWidthAndHeightOf(const char* character, \
                                            unsigned char* width, unsigned char* height);
//======================================================================================>
//void setStatusToPixelFromChar(pixel* addressMatrix, const char* character, posType pixelPos, unsigned int x, unsigned int y, unsigned char width);
#endif
//===================================================
//===============================\FUNCTIONS'_Definition/================================>
//======================================================================================>
/*	Initial : 0/+-360 degrees :
 *          33 :  / - - - - - - - -  -  -  -  -  -  -  /
 * 			32 :  \ - - - - - - - -  -  -  -  -  -  -  \.
 * 			 1 :  - - - - - - - - -  -  -  -  -  -  -  /
 * Starting LED-> 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16
 * Rotated : 90/-270 degrees :
 *       |   |   |   |   |   |   |   |   |   |  |  |  |  |  | | : 3
 *       |   |   |   |   |   |   |   |   |   |  |  |  |  |  | | : 2
 *       |   \   /   \   /   \   /   \   /   \  /  \  /  \  / | : 1
 *      256 225 224 193 192 161 160 129 128 97 96 65 64 33 32 1  <- Starting LED.
 * Rotated : 180/-180 degrees :
 *       \   -   -   -   -   -   -   -   -   -   -   -   -   -   -   \ : 224
 * 		/   -   -   -   -   -   -   -   -   -   -   -   -   -   -   / : 225
 * 		\   -   -   -   -   -   -   -   -   -   -   -   -   -   -   - : 256
 *      241 242 243 244 245 246 247 248 249 250 251 252 253 254 255 256
 * Rotated : 270/-90 degrees :
 *       |  |  |  |  |  |  |   |   |   |   |   |   |   |   |   | : 243
 *       |  |  |  |  |  |  |   |   |   |   |   |   |   |   |   | : 242
 *       \  /  \  /  \  /  \   /   \   /   \   /   \   /   \   / : 241
 *      16 17 48 49 80 81 112 113 144 145 176 177 208 209 240 241                      */
posType pixel_RecoverPosition(unsigned char posX, unsigned char posY) {
	posType ui16_returnPos = 0;
	// Condition about exceeding/equaling the MAX_COLU or MAX_LINE.
	/*if (MAX_COLU < posX)  posX = MAX_COLU - 1;
	if (MAX_LINE < posY)  posY = MAX_LINE - 1;*/
	switch (formatDisplay.orientation) {
		case 0: case 360: case (-360):
		default :
			if (!(posY % 2))   // Even lines on the matrix physical view.
				ui16_returnPos = posX /
								 MAX_COLU * MAX_LEDS + posX % MAX_COLU + posY * MAX_COLU;
			else
				ui16_returnPos = posX /
								 	MAX_COLU * MAX_LEDS + (posY + 1) * MAX_COLU -
								 		posX % MAX_COLU - 1;
			break;

		case 90: case (-270):
			if (!(posX % 2))   // Even columns on the matrix physical view.
				ui16_returnPos = MAX_LEDS - posX * MAX_LINE - posY - 1;
			else
				ui16_returnPos = MAX_LEDS - (posX + 1) * MAX_LINE + posY;
			break;

		case 180: case (-180):
			if ((posY % 2) == 0) // Even reverted lines on the matrix physical view.
				ui16_returnPos = MAX_LEDS - (posY + 1) * MAX_COLU + posX;
			else
				ui16_returnPos = MAX_LEDS - posY * MAX_COLU - posX - 1;
			break;

		case 270: case (-90):
			if (!(posX % 2))   // Even reverted columns on the matrix physical view.
				ui16_returnPos = (posX + 1) * MAX_LINE - posY - 1;
			else
				ui16_returnPos = (posX * MAX_LINE) + posY;
			break;
	}
	return ui16_returnPos;
}

//======================================================================================>
#ifdef __KC5_BP_MATRIX_ALPHANUM__
void matrix_SetTextPosition(unsigned char column, unsigned char line) {
	// COLUMN validity ..
	/*if(column >= MAX_COLU) Offset.column = MAX_COLU - 1;
	else Offset.column = column;

	// LINE validity ..
	if(line >= MAX_LINE) Offset.line = MAX_LINE - 1;
	else Offset.line = line;*/  // Problem with sliding if condition lept because force to MAX.

	Offset.column = column;
	Offset.line = line;
}
//======================================================================================>
void matrix_Print(pixel* addressMatrix, color newColor, const char* _CharToWrite) {
	xdata unsigned int _x, _y;
	xdata unsigned char charWidth, charHeight;
	const char* character;
	xdata posType pixelPos = 0;

