KC5-BP/C8051F020-WS2812B/refFiles/mx_manip/ws2812_mx_manip.c
	for(character = _CharToWrite; *character != '\0'; character++) {
		retrieveWidthAndHeightOf(character, &charWidth, &charHeight);

		for(_y = 0; _y < charHeight; ++_y) {
			for(_x = 0; _x < charWidth; ++_x) {
				pixelPos = pixel_RecoverPosition(_x + Offset.column, _y + Offset.line);
				// Condition about possible value for displaying or not.
				if(pixelPos >= ((MAX_COLU * MAX_LINE) * NBR_OF_MATRIX))
					continue;   // Restart loop with following value of j.

				switch(*character) {
					case ' ':
						addressMatrix[pixelPos].status = cBoard_Space[_x + _y * charWidth];
						break;
					case '!':
						addressMatrix[pixelPos].status = cBoard_ExclaMark[_x + _y * charWidth];
						break;
					//case '\"':
					case '#':
						//addressMatrix[pixelPos].status = cBoard_HashtagV1[_x + _y * charWidth];
						addressMatrix[pixelPos].status = cBoard_HashtagV2[_x + _y * charWidth];
						break;
					//case '$':
					//  addressMatrix[pixelPos].status = ;
					//  break;
					case '%':
						addressMatrix[pixelPos].status = cBoard_xMult[_x + _y * charWidth];
						break;
					case '&':
						addressMatrix[pixelPos].status = cBoard_Ampersand[_x + _y * charWidth];
						break;
					case '\'':
						addressMatrix[pixelPos].status = cBoard_Apost[_x + _y * charWidth];
						break;
					case '(':
						addressMatrix[pixelPos].status = cBoard_OpenBracket[_x + _y * charWidth];
						break;
					case ')':
						addressMatrix[pixelPos].status = cBoard_CloseBracket[_x + _y * charWidth];
						break;
					case '*':
						addressMatrix[pixelPos].status = cBoard_Asterisk[_x + _y * charWidth];
						break;
					case '+':
						addressMatrix[pixelPos].status = cBoard_Plus[_x + _y * charWidth];
						break;
					case ',':
						addressMatrix[pixelPos].status = cBoard_Comma[_x + _y * charWidth];
						break;
					case '-':
						addressMatrix[pixelPos].status = cBoard_Hyphen[_x + _y * charWidth];
						break;
					case '.':
						addressMatrix[pixelPos].status = cBoard_Dot[_x + _y * charWidth];
						break;
					case '/':
						addressMatrix[pixelPos].status = cBoard_Slash[_x + _y * charWidth];
						break;

					case '0':
						switch(formatDisplay.font) {
							case CLASSIC:
								addressMatrix[pixelPos].status = cBoard_0_Val[_x + _y * charWidth];
								break;
							case TIME:
								addressMatrix[pixelPos].status = cBoard_0_Time[_x + _y * charWidth];
								break;
							case MOB:
							default :
								addressMatrix[pixelPos].status = cBoard_0_Mob[_x + _y * charWidth];
								break;
						}
						break;
					case '1':
						switch(formatDisplay.font) {
							case CLASSIC:
								addressMatrix[pixelPos].status = cBoard_1_Val[_x + _y * charWidth];
								break;
							case TIME:
								addressMatrix[pixelPos].status = cBoard_1_Time[_x + _y * charWidth];
								break;
							case MOB:
							default :
								addressMatrix[pixelPos].status = cBoard_1_Mob[_x + _y * charWidth];
								break;
						}
						break;
					case '2':
						switch(formatDisplay.font) {
							case CLASSIC:
								addressMatrix[pixelPos].status = cBoard_2_Val[_x + _y * charWidth];
								break;
							case TIME:
								addressMatrix[pixelPos].status = cBoard_2_Time[_x + _y * charWidth];
								break;
							case MOB:
							default :
								addressMatrix[pixelPos].status = cBoard_2_Mob[_x + _y * charWidth];
								break;
						}
						break;
					case '3':
						switch(formatDisplay.font) {
							case CLASSIC:
								addressMatrix[pixelPos].status = cBoard_3_Val[_x + _y * charWidth];
								break;
							case TIME:
								addressMatrix[pixelPos].status = cBoard_3_Time[_x + _y * charWidth];
								break;
							case MOB:
							default :
								addressMatrix[pixelPos].status = cBoard_3_Mob[_x + _y * charWidth];
								break;
						}
						break;
					case '4':
						switch(formatDisplay.font) {
							case CLASSIC:
								addressMatrix[pixelPos].status = cBoard_4_Val[_x + _y * charWidth];
								break;
							case TIME:
								addressMatrix[pixelPos].status = cBoard_4_Time[_x + _y * charWidth];
								break;
							case MOB:
							default :
								addressMatrix[pixelPos].status = cBoard_4_Mob[_x + _y * charWidth];
								break;
						}
						break;
					case '5':
						switch(formatDisplay.font) {
							case CLASSIC:
								addressMatrix[pixelPos].status = cBoard_5_Val[_x + _y * charWidth];
								break;
							case TIME:
								addressMatrix[pixelPos].status = cBoard_5_Time[_x + _y * charWidth];
								break;
							case MOB:
							default :
								addressMatrix[pixelPos].status = cBoard_5_Mob[_x + _y * charWidth];
								break;
						}
						break;
					case '6':
						switch(formatDisplay.font) {
							case CLASSIC:
								addressMatrix[pixelPos].status = cBoard_6_Val[_x + _y * charWidth];
								break;
							case TIME:
								addressMatrix[pixelPos].status = cBoard_6_Time[_x + _y * charWidth];
								break;
							case MOB:
							default :
								addressMatrix[pixelPos].status = cBoard_6_Mob[_x + _y * charWidth];
								break;
						}
						break;
					case '7':
						switch(formatDisplay.font) {
							case CLASSIC:
								addressMatrix[pixelPos].status = cBoard_7_Val[_x + _y * charWidth];
								break;
							case TIME:
								addressMatrix[pixelPos].status = cBoard_7_Time[_x + _y * charWidth];
								break;
							case MOB:
							default :
								addressMatrix[pixelPos].status = cBoard_7_Mob[_x + _y * charWidth];
								break;
						}
						break;
					case '8':
						switch(formatDisplay.font) {
							case CLASSIC:
								addressMatrix[pixelPos].status = cBoard_8_Val[_x + _y * charWidth];
								break;
							case TIME:
								addressMatrix[pixelPos].status = cBoard_8_Time[_x + _y * charWidth];
								break;
							case MOB:
							default :
								addressMatrix[pixelPos].status = cBoard_8_Mob[_x + _y * charWidth];
								break;
						}
						break;
					case '9':
						switch(formatDisplay.font) {
							case CLASSIC:
								addressMatrix[pixelPos].status = cBoard_9_Val[_x + _y * charWidth];
								break;
							case TIME:
								addressMatrix[pixelPos].status = cBoard_9_Time[_x + _y * charWidth];
								break;
							case MOB:
							default :
								addressMatrix[pixelPos].status = cBoard_9_Mob[_x + _y * charWidth];
								break;
						}
						break;

					case ':':
						addressMatrix[pixelPos].status = cBoard_Colon[_x + _y * charWidth];
						break;
					case ';':
						addressMatrix[pixelPos].status = cBoard_SemiColon[_x + _y * charWidth];
						break;
					//case '<':
					//  addressMatrix[pixelPos].status = ;
					//  break;
					case '=':
						addressMatrix[pixelPos].status = cBoard_Equal[_x + _y * charWidth];
						break;
					//case '>':
					//  addressMatrix[pixelPos].status = ;
					//  break;
					case '?':
						switch(formatDisplay.font) {
							case CLASSIC:
								addressMatrix[pixelPos].status = cBoard_QuestMark[_x + _y * charWidth];
								break;
							case MOB:
							default :
								addressMatrix[pixelPos].status = cBoard_QuestMark_Mob[_x + _y * charWidth];
								break;
						}
						break;
					case '@':
						addressMatrix[pixelPos].status = cBoard_At[_x + _y * charWidth];
						break;

					case 'A':
						addressMatrix[pixelPos].status = cBoard_A[_x + _y * charWidth];
						break;
					case 'B':
						addressMatrix[pixelPos].status = cBoard_B[_x + _y * charWidth];
						break;
					case 'C':
						addressMatrix[pixelPos].status = cBoard_C[_x + _y * charWidth];
						break;
					case 'D':
						addressMatrix[pixelPos].status = cBoard_D[_x + _y * charWidth];
						break;
					case 'E':
						addressMatrix[pixelPos].status = cBoard_E[_x + _y * charWidth];
						break;
					case 'F':
						addressMatrix[pixelPos].status = cBoard_F[_x + _y * charWidth];
						break;
					case 'G':
						addressMatrix[pixelPos].status = cBoard_G[_x + _y * charWidth];
						break;
					case 'H':
						addressMatrix[pixelPos].status = cBoard_H[_x + _y * charWidth];
						break;
					case 'I':
						addressMatrix[pixelPos].status = cBoard_I[_x + _y * charWidth];
						break;
					case 'J':
						addressMatrix[pixelPos].status = cBoard_J[_x + _y * charWidth];
						break;
					case 'K':
						addressMatrix[pixelPos].status = cBoard_K[_x + _y * charWidth];
						break;
					case 'L':
						addressMatrix[pixelPos].status = cBoard_L[_x + _y * charWidth];
						break;
					case 'M':
						addressMatrix[pixelPos].status = cBoard_M[_x + _y * charWidth];
						break;
					case 'N':
						addressMatrix[pixelPos].status = cBoard_N[_x + _y * charWidth];
						break;
					case 'O':
						addressMatrix[pixelPos].status = cBoard_O[_x + _y * charWidth];
						break;
					case 'P':
						addressMatrix[pixelPos].status = cBoard_P[_x + _y * charWidth];
						break;
					case 'Q':
						addressMatrix[pixelPos].status = cBoard_Q[_x + _y * charWidth];
						break;
					case 'R':
						addressMatrix[pixelPos].status = cBoard_R[_x + _y * charWidth];
						break;
					case 'S':
						addressMatrix[pixelPos].status = cBoard_S[_x + _y * charWidth];
						break;
					case 'T':
						addressMatrix[pixelPos].status = cBoard_T[_x + _y * charWidth];
						break;
					case 'U':
						addressMatrix[pixelPos].status = cBoard_U[_x + _y * charWidth];
						break;
					case 'V':
						addressMatrix[pixelPos].status = cBoard_V[_x + _y * charWidth];
						break;
					case 'W':
						addressMatrix[pixelPos].status = cBoard_W[_x + _y * charWidth];
						break;
					case 'X':
						addressMatrix[pixelPos].status = cBoard_X[_x + _y * charWidth];
						break;
					case 'Y':
						addressMatrix[pixelPos].status = cBoard_Y[_x + _y * charWidth];
						break;
					case 'Z':
						addressMatrix[pixelPos].status = cBoard_Z[_x + _y * charWidth];
						break;

