KC5-BP/C8051F020-WS2812B/refFiles/mx_manip/ws2812_mx_manip.c
					case '[':
						addressMatrix[pixelPos].status = cBoard_OpenSqBracket[_x + _y * charWidth];
						break;
					//case '\\':
					//  addressMatrix[pixelPos].status = ;
					//  break;
					case ']':
						addressMatrix[pixelPos].status = cBoard_CloseSqBracket[_x + _y * charWidth];
						break;
					case '^':
						addressMatrix[pixelPos].status = cBoard_Heart[_x + _y * charWidth];
						break;
					case '_':
						addressMatrix[pixelPos].status = cBoard_Underscore[_x + _y * charWidth];
						break;
					//case '`':
					//  addressMatrix[pixelPos].status = ;
					//  break;
					case '{':
						addressMatrix[pixelPos].status = cBoard_OpenRoBracket[_x + _y * charWidth];
						break;
					//case '|':
					//  addressMatrix[pixelPos].status = ;
					//  break;
					case '}':
						addressMatrix[pixelPos].status = cBoard_CloseRoBracket[_x + _y * charWidth];
						break;
					case '~':
						addressMatrix[pixelPos].status = cBoard_Tilda[_x + _y * charWidth];
						break;

					case '\n':
						// Reset X
						Offset.column = 0;
						// Decrease Line of Height + 1 line to make a space.
						Offset.line -= 8;
						break;

					//State of every undefined case, so not supposed to come here.
					default :   break;
				}

				//setStatusToPixelFromChar(&addressMatrix[0], character, pixelPos, _x, _y, charWidth);
				// Coloring only One char at a Time :
				if(addressMatrix[pixelPos].status != 0)
					addressMatrix[pixelPos].colorPix = newColor;
				else
					addressMatrix[pixelPos].colorPix = BLACK;
			}
		}
		// Space auto management while entering multiple char. except with '\n'
		if(*character != '\n')
			Offset.column += (charWidth + 1);
	}
	//leds_Show(addressMatrix); // Crash with it and I need to find out why ...
}

void retrieveWidthAndHeightOf(const char* character, \
										unsigned char* width, unsigned char* height) {
	switch(*character) {
		// Letters : ---------------------------------------------------->
		case 'A':	case 'B':	case 'C':   case 'D':	case 'E':   case 'F':   case 'G':
		case 'H':	case 'J':   case 'K':   case 'L':   case 'N':   case 'O':	case 'P':
		case 'Q':	case 'R':	case 'S':   case 'U':   case 'X':	case 'Y':	case 'Z':
		case '_':
			*width = 4;
			*height = 7;
			break;
		case 'I':case 'T':
		case ' ':	case '.':   case ',':   case '!':
		case ':':	case '=':   case '*':   case '-':
		case '+':	case '%':   /*case '°':*/   case '/':
			*width = 3;
			*height = 7;
			break;
		case 'M':	case 'V':	case 'W':
		case '(':	case ')':   case '{':   case '}':
		case '[':	case ']':   case '~':   case '@':
		case '#':	case '&':
			*width = 5;
			*height = 7;
			break;

		// Numbers + Style : -------------------------------------------->
		case '0':	case '1':	case '2':	case '3':	case '4':
		case '5':	case '6':	case '7':	case '8':	case '9':
			switch(formatDisplay.font) {
				case CLASSIC:
				default:
					*width = 4;
					*height = 7;
					break;
				case TIME:
					*width = 5;
					*height = 7;
					break;
				case MOB:
					*width = 4;
					*height = 6;
					break;
			}
			break;

		// Special Char. : ---------------------------------------------->
		case '\'':
			*width = 2;
			*height = 7;
			break;

		case '^':
			*width = 7;
			*height = 6;
			break;

		case '?':
			switch(formatDisplay.font) {
				case CLASSIC:
					*width = 4;
					*height = 7;
					break;
				case MOB:
					*width = 5;
					*height = 7;
					break;
				/* State of every undefined case, so not supposed to come here. */
				default :	break;
			}
			break;

		/* State of every undefined case, so not supposed to come here. */
		default :   break;
	}
}
/*
void setStatusToPixelFromChar(pixel* addressMatrix, const char* character, posType pixelPos, unsigned int x, unsigned int y, unsigned char width) {
	switch(*character) {
		case ' ':
			addressMatrix[pixelPos].status = cBoard_Space[x + y * width];
			break;
		case '!':
			addressMatrix[pixelPos].status = cBoard_ExclaMark[x + y * width];
			break;
		//case '\"':
		case '#':
			//addressMatrix[pixelPos].status = cBoard_HashtagV1[x + y * width];
			addressMatrix[pixelPos].status = cBoard_HashtagV2[x + y * width];
			break;
		//case '$':
		//  addressMatrix[pixelPos].status = ;
		//  break;
		case '%':
			addressMatrix[pixelPos].status = cBoard_xMult[x + y * width];
			break;
		case '&':
			addressMatrix[pixelPos].status = cBoard_Ampersand[x + y * width];
			break;
		case '\'':
			addressMatrix[pixelPos].status = cBoard_Apost[x + y * width];
			break;
		case '(':
			addressMatrix[pixelPos].status = cBoard_OpenBracket[x + y * width];
			break;
		case ')':
			addressMatrix[pixelPos].status = cBoard_CloseBracket[x + y * width];
			break;
		case '*':
			addressMatrix[pixelPos].status = cBoard_Asterisk[x + y * width];
			break;
		case '+':
			addressMatrix[pixelPos].status = cBoard_Plus[x + y * width];
			break;
		case ',':
			addressMatrix[pixelPos].status = cBoard_Comma[x + y * width];
			break;
		case '-':
			addressMatrix[pixelPos].status = cBoard_Hyphen[x + y * width];
			break;
		case '.':
			addressMatrix[pixelPos].status = cBoard_Dot[x + y * width];
			break;
		case '/':
			addressMatrix[pixelPos].status = cBoard_Slash[x + y * width];
			break;

		case '0':
			switch(formatDisplay.font) {
				case CLASSIC:
					addressMatrix[pixelPos].status = cBoard_0_Val[x + y * width];
					break;
				case TIME:
					addressMatrix[pixelPos].status = cBoard_0_Time[x + y * width];
					break;
				case MOB:
				default :
					addressMatrix[pixelPos].status = cBoard_0_Mob[x + y * width];
					break;
			}
			break;
		case '1':
			switch(formatDisplay.font) {
				case CLASSIC:
					addressMatrix[pixelPos].status = cBoard_1_Val[x + y * width];
					break;
				case TIME:
					addressMatrix[pixelPos].status = cBoard_1_Time[x + y * width];
					break;
				case MOB:
				default :
					addressMatrix[pixelPos].status = cBoard_1_Mob[x + y * width];
					break;
			}
			break;
		case '2':
			switch(formatDisplay.font) {
				case CLASSIC:
					addressMatrix[pixelPos].status = cBoard_2_Val[x + y * width];
					break;
				case TIME:
					addressMatrix[pixelPos].status = cBoard_2_Time[x + y * width];
					break;
				case MOB:
				default :
					addressMatrix[pixelPos].status = cBoard_2_Mob[x + y * width];
					break;
			}
			break;
		case '3':
			switch(formatDisplay.font) {
				case CLASSIC:
					addressMatrix[pixelPos].status = cBoard_3_Val[x + y * width];
					break;
				case TIME:
					addressMatrix[pixelPos].status = cBoard_3_Time[x + y * width];
					break;
				case MOB:
				default :
					addressMatrix[pixelPos].status = cBoard_3_Mob[x + y * width];
					break;
			}
			break;
		case '4':
			switch(formatDisplay.font) {
				case CLASSIC:
					addressMatrix[pixelPos].status = cBoard_4_Val[x + y * width];
					break;
				case TIME:
					addressMatrix[pixelPos].status = cBoard_4_Time[x + y * width];
					break;
				case MOB:
				default :
					addressMatrix[pixelPos].status = cBoard_4_Mob[x + y * width];
					break;
			}
			break;
		case '5':
			switch(formatDisplay.font) {
				case CLASSIC:
					addressMatrix[pixelPos].status = cBoard_5_Val[x + y * width];
					break;
				case TIME:
					addressMatrix[pixelPos].status = cBoard_5_Time[x + y * width];
					break;
				case MOB:
				default :
					addressMatrix[pixelPos].status = cBoard_5_Mob[x + y * width];
					break;
			}
			break;
		case '6':
			switch(formatDisplay.font) {
				case CLASSIC:
					addressMatrix[pixelPos].status = cBoard_6_Val[x + y * width];
					break;
				case TIME:
					addressMatrix[pixelPos].status = cBoard_6_Time[x + y * width];
					break;
				case MOB:
				default :
					addressMatrix[pixelPos].status = cBoard_6_Mob[x + y * width];
					break;
			}
			break;
		case '7':
			switch(formatDisplay.font) {
				case CLASSIC:
					addressMatrix[pixelPos].status = cBoard_7_Val[x + y * width];
					break;
				case TIME:
					addressMatrix[pixelPos].status = cBoard_7_Time[x + y * width];
					break;
				case MOB:
				default :
					addressMatrix[pixelPos].status = cBoard_7_Mob[x + y * width];
					break;
			}
			break;
		case '8':
			switch(formatDisplay.font) {
				case CLASSIC:
					addressMatrix[pixelPos].status = cBoard_8_Val[x + y * width];
					break;
				case TIME:
					addressMatrix[pixelPos].status = cBoard_8_Time[x + y * width];
					break;
				case MOB:
				default :
					addressMatrix[pixelPos].status = cBoard_8_Mob[x + y * width];
					break;
			}
			break;
		case '9':
			switch(formatDisplay.font) {
				case CLASSIC:
					addressMatrix[pixelPos].status = cBoard_9_Val[x + y * width];
					break;
				case TIME:
					addressMatrix[pixelPos].status = cBoard_9_Time[x + y * width];
					break;
				case MOB:
				default :
					addressMatrix[pixelPos].status = cBoard_9_Mob[x + y * width];
					break;
			}
			break;

		case ':':
			addressMatrix[pixelPos].status = cBoard_Colon[x + y * width];
			break;
		case ';':
			addressMatrix[pixelPos].status = cBoard_SemiColon[x + y * width];
			break;
		//case '<':
		//  addressMatrix[pixelPos].status = ;
		//  break;
		case '=':
			addressMatrix[pixelPos].status = cBoard_Equal[x + y * width];
			break;
		//case '>':
		//  addressMatrix[pixelPos].status = ;
		//  break;
		case '?':
			switch(formatDisplay.font) {
				case CLASSIC:
					addressMatrix[pixelPos].status = cBoard_QuestMark[x + y * width];
					break;
				case MOB:
				default :
					addressMatrix[pixelPos].status = cBoard_QuestMark_Mob[x + y * width];
					break;
			}
			break;
		case '@':
			addressMatrix[pixelPos].status = cBoard_At[x + y * width];
			break;

		case 'A':
			addressMatrix[pixelPos].status = cBoard_A[x + y * width];
			break;
		case 'B':
			addressMatrix[pixelPos].status = cBoard_B[x + y * width];
			break;
		case 'C':
			addressMatrix[pixelPos].status = cBoard_C[x + y * width];
			break;
		case 'D':
			addressMatrix[pixelPos].status = cBoard_D[x + y * width];
			break;
		case 'E':
			addressMatrix[pixelPos].status = cBoard_E[x + y * width];
			break;
		case 'F':
			addressMatrix[pixelPos].status = cBoard_F[x + y * width];
			break;
		case 'G':
			addressMatrix[pixelPos].status = cBoard_G[x + y * width];
			break;
		case 'H':
			addressMatrix[pixelPos].status = cBoard_H[x + y * width];
			break;
		case 'I':
			addressMatrix[pixelPos].status = cBoard_I[x + y * width];
			break;
		case 'J':
			addressMatrix[pixelPos].status = cBoard_J[x + y * width];
			break;
		case 'K':
			addressMatrix[pixelPos].status = cBoard_K[x + y * width];
			break;
		case 'L':
			addressMatrix[pixelPos].status = cBoard_L[x + y * width];
			break;
		case 'M':
			addressMatrix[pixelPos].status = cBoard_M[x + y * width];
			break;
		case 'N':
			addressMatrix[pixelPos].status = cBoard_N[x + y * width];
			break;
		case 'O':
			addressMatrix[pixelPos].status = cBoard_O[x + y * width];
			break;
		case 'P':
			addressMatrix[pixelPos].status = cBoard_P[x + y * width];
			break;
		case 'Q':
			addressMatrix[pixelPos].status = cBoard_Q[x + y * width];
			break;
		case 'R':
			addressMatrix[pixelPos].status = cBoard_R[x + y * width];
			break;
		case 'S':
			addressMatrix[pixelPos].status = cBoard_S[x + y * width];
			break;
		case 'T':
			addressMatrix[pixelPos].status = cBoard_T[x + y * width];
			break;
		case 'U':
			addressMatrix[pixelPos].status = cBoard_U[x + y * width];
			break;
		case 'V':
			addressMatrix[pixelPos].status = cBoard_V[x + y * width];
			break;
		case 'W':
			addressMatrix[pixelPos].status = cBoard_W[x + y * width];
			break;
		case 'X':
			addressMatrix[pixelPos].status = cBoard_X[x + y * width];
			break;
		case 'Y':
			addressMatrix[pixelPos].status = cBoard_Y[x + y * width];
			break;
		case 'Z':
			addressMatrix[pixelPos].status = cBoard_Z[x + y * width];
			break;

		case '[':
			addressMatrix[pixelPos].status = cBoard_OpenSqBracket[x + y * width];
			break;
		//case '\\':
		//  addressMatrix[pixelPos].status = ;
		//  break;
		case ']':
			addressMatrix[pixelPos].status = cBoard_CloseSqBracket[x + y * width];
			break;
		case '^':
			addressMatrix[pixelPos].status = cBoard_Heart[x + y * width];
			break;
		case '_':
			addressMatrix[pixelPos].status = cBoard_Underscore[x + y * width];
			break;
		//case '`':
		//  addressMatrix[pixelPos].status = ;
		//  break;
		case '{':
			addressMatrix[pixelPos].status = cBoard_OpenRoBracket[x + y * width];
			break;
		//case '|':
		//  addressMatrix[pixelPos].status = ;
		//  break;
		case '}':
			addressMatrix[pixelPos].status = cBoard_CloseRoBracket[x + y * width];
			break;
		case '~':
			addressMatrix[pixelPos].status = cBoard_Tilda[x + y * width];
			break;

		case '\n':
			// Reset X
			Offset.column = 0;
			// Decrease Line of Height + 1 line to make a space.
			Offset.line -= 8;
			break;

		default :   break;
	}
}*/
#endif